<template>
  <div class="app-container">
    <el-container>
      <el-header>绩效评估流程通知</el-header>
      <el-main>
        <el-alert
          title="注意：绩效评估流程公告"
          type="success"
          show-icon>
        </el-alert>
        <el-card class="box-card" :body-style="{ padding: '20px' }">
          <p>尊敬的同事们：</p>
          <p>
            为促进公司持续进步和员工个人职业成长，我们将从即日起启动本年度的绩效评估流程。本次评估旨在全面了解并认可大家的工作表现以及潜能，是公司发展和员工成长的重要组成部分。</p>
          <p>本次绩效评估的流程如下：</p>
          <el-timeline>
            <el-timeline-item
              v-for="(item, index) in timelineData"
              :key="index"
              :timestamp="item.timestamp"
              :placement="'top'">
<!--              :placement="index % 2 === 0 ? 'top' : 'bottom'">-->

              <el-card shadow="never">
                <h4>{{ item.title }}</h4>
<!--                <p>{{ item.content }}</p>-->
                <div v-html="formatContent(item.content)"></div>
              </el-card>
            </el-timeline-item>
          </el-timeline>
          <p>
            我们鼓励大家以开放心态参与评估，认真反思自己在过去一段时间内的表现，积极展示自己的成就，并且客观地设定未来的职业发展目标。</p>
          <p>如果您对绩效评估流程有任何疑问，或者需要帮助和指导，欢迎随时联系人力资源部进行咨询。</p>
          <p>衷心感谢大家的努力和贡献，希望我们共同努力，推动自己和公司不断向前发展！</p>
          <p>此致</p>
          <p>人力资源部</p>
        </el-card>
      </el-main>
    </el-container>
  </div>
</template>


<script>
export default {
  name: 'Performance',
  data() {
    return {
      timelineData: [
        {
          timestamp: "步骤 1: 自我评估",
          title: "个人成长与工作表现自我评估",
          content: `
            - 对于过去一年的个人成长进行回顾，包括技能提升、新知识学习、职责扩展等。
            - 总结在关键项目和日常工作中的成就和贡献，包括成功完成的任务、特殊贡献、创造的业绩等。
            - 反思在团队合作、沟通、领导力等软技能方面的表现。
            - 识别工作中遇到的挑战和不足，包括任何失误、未达成的目标、改进的方向等。
            - 确定未来的职业目标以及这些目标对个人和公司的潜在价值。
            - 明确下一个评估周期内希望实现的具体目标和成果，以及为实现这些目标将采取的行动计划。
            综上所述，自我评估不仅应当包括成就和优点的展示，还应该涵盖对挑战和不足的坦诚反思以及针对未来的规划和设想。自我评估的目的在于促进个人发展，提高工作效率，为职业生涯设定明确的轨道。`
        },
        {
          timestamp: "步骤 2: 主管评估",
          title: "综合绩效评估与反馈",
          content: `
            - 对员工在关键业务领域的工作成果进行评价，考察其对于公司目标的贡献程度。
            - 评估员工在完成任务和项目时表现出的专业能力、技术技能以及解决问题的能力。
            - 分析员工在团队中的参与度，包括其对团队建设、协作以及支持同事方面的贡献。
            - 考察员工的创新能力，评价其在改进流程、提出新观点及实施新方法方面的努力。
            - 根据员工的自我评估以及已有的绩效数据，提供平衡而全面的反馈，包括肯定其成绩和指出可改进之处。
            - 与员工共同探讨个人职业发展的目标，为其提供指导和支持，帮助确定实现这些目标的路径和方法。
            - 建立绩效改进计划，在员工表现不佳的领域设定明确的改善目标和时间表。
            总结来说，主管评估不仅涉及对员工工作表现的客观评价，还包括为员工未来的成长提供指导和资源，确保评估建立在提升员工发展和增加公司价值的基础之上。`
        },
        {
          timestamp: "步骤 3: 一对一面谈",
          title: "个人发展与职业规划对话",
          content: `
            - 安排一个具有建设性的一对一会议，为员工提供一个自由表达想法和感受的空间。
            - 讨论主管评估的反馈，包括强项、改进区域以及任何具体的表现实例。
            - 对员工在自我评估中提出的目标和成就进行讨论，并探讨其对个人职业生涯及团队的潜在影响。
            - 评估员工的职业发展需求和愿望，并提供职业规划的资源和指导。
            - 根据讨论结果设置可行的职业发展步骤，如培训、指导、项目机会等。
            - 确定和同意明确的行动计划，完成时间表，并设立后续跟进会议以监督进程。`
        },
        {
          timestamp: "步骤 4: 目标设定",
          title: "下一周期发展目标设定",
          content: `
            - 与员工一起设立SMART目标（具体的、可测量的、可达成的、相关性强的、时限的）。
            - 确保目标与公司的长期战略和短期业务目标保持一致。
            - 讨论并设立个人专业成长目标，包括期望掌握的新技能和知识领域。
            - 设立与员工工作表现和行为表现相关的目标，鼓励良好工作习惯和团队合作精神。
            - 建立定期检查的机制来监督目标执行情况，如季度评估更新进度。
            - 确保目标设置过程是双向的，员工可以积极参与并对自己的职业发展负责。`
        },
        {
          timestamp: "步骤 5: 绩效复议",
          title: "绩效评估结果复议机会",
          content: `
            - 如果员工对于绩效评估的结果有异议，可提供一个正式的复议流程。
            - 详细解释复议流程，包括如何提交申请、复议的时间框架及可能涉及的步骤。
            - 确保复议流程公正、透明，员工的意见得到充分理解和重视。
            - 安排与不同管理层级的沟通会议，以便更全面地评估员工所提的关切点。
            - 提供额外的证据或反馈材料，帮助员工更好地理解评估结果。
            - 根据复议结果，可能需要调整目标设定或职业发展建议。`
        }
      ]
    };
  },
  methods:{
    formatContent(content) {
      return content.replace(/\n/g, '<br>');
    }
  },
}
</script>


<style scoped lang="scss">
.el-container {
  margin: 30px auto;
  width: 80%;
}

.el-header {
  background-color: #b3c0d1;
  color: white;
  text-align: center;
  padding: 20px;
}

.box-card {
  margin-top: 20px;
}

p {
  margin-bottom: 10px;
}
</style>
